# more recent versions of some macOS tools
brew 'grep'
brew 'zsh'

# essential packages
brew 'stow'
brew 'ripgrep'
brew 'bat'
brew 'zplug'
brew 'git'
brew 'neovim'
brew 'python3'
brew 'yarn'
brew 'nvm'
brew 'lazygit'
brew 'tmux'
brew 'lsd'
brew 'tree'
brew 'git-delta'
brew 'zoxide'
brew 'stylua'
brew 'lf'
brew 'fd'
brew 'fzf'

# applications
cask 'google-chrome'
cask 'spotify'
cask 'alacritty'
cask 'raycast'
cask 'discord'
cask 'appcleaner'
cask 'karabiner-elements'
cask 'alt-tab'
cask 'visual-studio-code'
cask 'the-unarchiver'

# fonts
cask 'font-hack-nerd-font'
cask 'font-meslo-lg-nerd-font'
